#pragma once

#pragma region REFERENCES
#pragma endregion REFERENCES

#pragma region INCLUDES
//
#include "helpers.h"
//
#include "abstractEmulation.h"
#pragma endregion INCLUDES

#pragma region MACROS
#pragma region WIP
#pragma endregion WIP
#define GB_GBC_FPS										59.73f
#define EMULATED_AUDIO_SAMPLING_RATE_FOR_GB_GBC			48000.0f
#ifdef __EMSCRIPTEN__
#define AUDIO_BUFFER_SIZE_FOR_GB_GBC					(CEIL((EMULATED_AUDIO_SAMPLING_RATE_FOR_GB_GBC / GB_GBC_FPS)))  // 32
#else
#define AUDIO_BUFFER_SIZE_FOR_GB_GBC					(CEIL((EMULATED_AUDIO_SAMPLING_RATE_FOR_GB_GBC / GB_GBC_FPS)))
#endif
#define PIXEL_FIFO_SIZE_FOR_GB_GBC						(SIXTEEN)

#ifdef _MSC_VER  
#define __packed  
#pragma pack(1)  
#endif
#pragma endregion MACROS

#pragma region CORE
class GBc_t : public abstractEmulation_t
{
#pragma region INFRASTRUCTURE_DECLARATIONS

public:

	std::array<std::string, MAX_NUMBER_ROMS_PER_PLATFORM> rom;
	const float myFPS = (float)GB_GBC_FPS;

public:

	uint32_t y_offset = 0;
	uint32_t x_offset = 0;
	static const uint32_t screen_height = 144;
	static const uint32_t screen_width = 160;
	static const uint32_t pixel_height = 2;
	static const uint32_t pixel_width = 2;
	static const uint32_t debugger_screen_height = 560;
	static const uint32_t debugger_screen_width = 456; // 880
	static const uint32_t debugger_pixel_height = 1;
	static const uint32_t debugger_pixel_width = 1;
	const char* NAME = "GB-GBC";

private:

	boost::property_tree::ptree pt;

private:

	uint8_t const SST_ROMS = TWO;

private:

	uint32_t profiler_FrameRate;
	uint64_t functionID;

private:

	CheatEngine_t* ceGBGBC;
#pragma endregion INFRASTRUCTURE_DECLARATIONS

#pragma region SM83_DECLARATION
private:

	enum class REGISTER_TYPE	// register_op_type
	{
		RT_A,				// 0
		RT_F,				// 1
		RT_B,				// 2
		RT_C,				// 3
		RT_D,				// 4
		RT_E,				// 5
		RT_H,				// 6
		RT_L,				// 7
		RT_PC,				// 8
		RT_SP,				// 9
		RT_AF,				// 10
		RT_BC,				// 11
		RT_DE,				// 12
		RT_HL,				// 13
		RT_IE,				// 14
		RT_TOTAL,			// TOTAL = 15
		RT_NONE
	};

	enum class POINTER_TYPE
	{
		RT_M_HL,			// 0
		RT_M_DE,			// 1
		RT_M_BC,			// 2
		RT_M_TOTAL,			// TOTAL = 3
		RT_M_NONE
	};

	enum class CPU_TICK_TYPE
	{
		READ_WRITE,
		DUMMY
	};

private:

#pragma pack(push, 1)

	typedef struct
	{
		uint8_t opcode;
		uint8_t previousOpcode;
	} cpu_t;

	typedef struct
	{
		uint8_t ZEROTH : 1; // bit  0
		uint8_t FIRST : 1; // bit  1
		uint8_t SECOND : 1; // bit  2
		uint8_t THIRD : 1; // bit  3
		uint8_t FCARRY : 1; // bit  4
		uint8_t FHALFCARRY : 1; // bit  5	
		uint8_t FSUB : 1; // bit  6
		uint8_t FZERO : 1; // bit  7
	} flagFields_t;

	typedef union
	{
		flagFields_t flagFields;
		uint8_t flagMemory;
	} flag_t;

	typedef struct
	{
		flag_t f;				// 0 - 7
		uint8_t a;				// 8 - 15
	} aAndFRegisters_t;

	typedef union
	{
		aAndFRegisters_t aAndFRegisters;
		uint16_t af_u16memory;	// <-a->|<-f->
	} af_t;

	typedef struct
	{
		uint8_t c;				// 0 - 7
		uint8_t b;				// 8 - 15
	} bAndCRegisters_t;

	typedef union
	{
		bAndCRegisters_t bAndCRegisters;
		uint16_t bc_u16memory;	// <-b->|<-c->
	} bc_t;

	typedef struct
	{
		uint8_t e;				// 0 - 7
		uint8_t d;				// 8 - 15
	} dAndERegisters_t;

	typedef union
	{
		dAndERegisters_t dAndERegisters;
		uint16_t de_u16memory;	// <-d->|<-e->
	} de_t;

	typedef struct
	{
		uint8_t l;				// 0 - 7
		uint8_t h;				// 8 - 15
	} hAndLRegisters_t;

	typedef union
	{
		hAndLRegisters_t hAndLRegisters;
		uint16_t hl_u16memory;	// <-h->|<-l->
	} hl_t;

	typedef struct
	{
		af_t af;
		bc_t bc;
		de_t de;
		hl_t hl;
		uint16_t pc;
		uint16_t sp;
	} registers_t;

#pragma endregion SM83_DECLARATION

#pragma region EMULATION_DECLARATIONS
private:

	bios_t dmg_cgb_bios;

private:

	enum class MEMORY_ACCESS_SOURCE
	{
		DEBUG_PORT,
		CPU,
		PPU,
		APU,
		OAMDMA,
		GPDMA,
		HDMA,
		BESS
	};

	enum HALT_BUG_STATE : bool
	{
		HALT_BUG_DISABLED,
		HALT_BUG_ENABLED
	};

	enum class INTERRUPTS
	{
		INTERRUPT_INVALID = -1,
		NO_INTERRUPT = 0x00,
		VBLANK_INTERRUPT = 0x01,
		LCD_STAT_INTERRUPT = 0x02,
		TIMER_INTERRUPT = 0x04,
		SERIAL_INTERRUPT = 0x08,
		JOYPAD_INTERRUPT = 0x10
	};

	enum EI_ENABLE_STATE : bool
	{
		NOTHING_TO_BE_DONE,
		EI_TO_BE_ENABLED
	};

	enum class CGB_DMA_MODE
	{
		GPDMA = 0,
		HDMA
	};

	enum DIVIDERS : int16_t
	{
		DIVIDER_INVALID = -1,
		DIVIDER_TOTAL = 1,

		// DIVIDER_01 is 16384 Hz -> 16384 increments in 1 second (runs w.r.t to Clock like eveything else in GB)
		// Clock is 4.194304 MHz -> 4194304 increments or ticks in 1 second
		// We have the clock ticks in the form of emulated CPU cycles 
		// Display Rate / VBlank interrupt for GB is @ 60 Hz, so @ 60 Hz, we need to re-process and push the COMPLETE HUGE GFX to display
		// So, our master loop is set to run @ 60 Hz, which inturn will house the while loop for core; after every 60 Hz loop, we process the VBlank
		// We run a continous while loop for simulating the GB core, but the host speed is too much, so to maintain it similar to GB
		// At max, we need to run 70221 core loops per 60 Hz function
		// In one frame @ 60 Hz, we run for 70221 clock ticks (i.e emulated CPU cycles)
		// In one frame @ 60 Hz, we run for (4.194304 MHx / 16384 Hz) divider ticks
		// In one frame @ 60 Hz, we run for 256 divider ticks

		DIVIDER_01 = 256
	};

	enum TIMERS : int16_t
	{
		TIMER_INVALID = -1,
		// Refer DIVIDERS enum for the explaination on how we got the value for TIMER_01
		TIMER_01 = 16,		// 4.194304 MHz / 262144 Hz
		// Refer DIVIDERS enum for the explaination on how we got the value for TIMER_02
		TIMER_10 = 64,		// 4.194304 MHz / 65536 Hz
		// Refer DIVIDERS enum for the explaination on how we got the value for TIMER_03
		TIMER_11 = 256,		// 4.194304 MHz / 16384 Hz
		// Refer DIVIDERS enum for the explaination on how we got the value for TIMER_04
		TIMER_00 = 1024		// 4.194304 MHz / 4096 Hz 
	};

	enum JOYPAD_STATES : uint8_t
	{
		PRESSED = ZERO,
		NOT_PRESSED = ONE
	};

	enum AUDIO_CHANNELS : uint8_t
	{
		CHANNEL_1 = ZERO,
		CHANNEL_2 = ONE,
		CHANNEL_3 = TWO,
		CHANNEL_4 = THREE,
		TOTAL_CHANNELS
	};

	enum class AUDIO_STREAMS
	{
		L = ZERO,
		R = ONE,
		TOTAL_AUDIO_STREAMS
	};

	const uint8_t AUDIO_CHANNEL_4_DIVISOR[EIGHT]
	{
		/* 0 */ 8,
		/* 1 */ 16,
		/* 2 */ 32,
		/* 3 */ 48,
		/* 4 */ 64,
		/* 5 */ 80,
		/* 6 */ 96,
		/* 7 */ 112
	};

	const uint8_t SQUARE_WAVE_AMPLITUDE[FOUR][EIGHT] =
	{
		{LO, LO, LO, LO, LO, LO, LO, HI},
		{LO, LO, LO, LO, LO, LO, HI, HI},
		{LO, LO, LO, LO, HI, HI, HI, HI},
		{HI, HI, HI, HI, HI, HI, LO, LO}
	};

	enum class PIXEL_FETCHER_STATES
	{
		DUMMY = ZERO,
		WAIT_FOR_TILE = ONE,
		GET_TILE = TWO,
		WAIT_FOR_DATA_LOW = THREE,
		GET_TILE_DATA_LOW = FOUR,
		WAIT_FOR_DATA_HIGH = FIVE,
		GET_TILE_DATA_HIGH = SIX,
		SLEEP_OR_PUSH = SEVEN
	};

	enum LCD_MODES : uint8_t
	{
		MODE_LCD_H_BLANK = 0,
		MODE_LCD_V_BLANK = 1,
		MODE_LCD_SEARCHING_OAM = 2,
		MODE_LCD_DISPLAY_PIXELS = 3,
		// This is set to 4 as bits 0-1 is still 0 and we can differentiate b/w MODE_LCD_H_BLANK and MOCE_LCD_BITS_CLEAR
		MODE_LCD_BITS_CLEAR = 4,
	};

	enum LCD_MODE_CYCLES : uint16_t
	{
		LCD_SEARCHING_OAM = 80,
		TX_DATA_LCD_CTRL_MIN = 172,
		TX_DATA_LCD_CTRL_MAX = 289,
		LCD_H_BLANK_MIN = 87,
		LCD_H_BLANK_MAX = 204,
		LCD_TOTAL_CYCLES_PER_SCANLINE = 456,
		LCD_V_BLANK = 4560,
	};

private:

	typedef struct
	{
		uint32_t placeholder;
	} quirks_t;

private:

	static const uint8_t ALPHA = 255;

	enum class colorID
	{
		COLOR_099P,
		COLOR_066P,
		COLOR_033P,
		COLOR_000P
	};

	typedef struct
	{
		Pixel COLOR;
		colorID COLOR_ID;
	} COLOR_FORMAT;

	typedef struct
	{
		COLOR_FORMAT COLOR_099P;
		COLOR_FORMAT COLOR_066P;
		COLOR_FORMAT COLOR_033P;
		COLOR_FORMAT COLOR_000P;
	} FORMAT_2BPP;

	std::unordered_map<PALETTE_ID, FORMAT_2BPP> const paletteIDToColor =
	{
		{PALETTE_ID::PALETTE_1,
		{{Pixel(0x14, 0x44, 0x03, ALPHA), colorID::COLOR_099P}, {Pixel(0x2B, 0x55, 0x03, ALPHA), colorID::COLOR_066P}, {Pixel(0x4D, 0x6B, 0x03, ALPHA), colorID::COLOR_033P}, {Pixel(0x87, 0x96, 0x03, ALPHA), colorID::COLOR_000P}}}
		,{PALETTE_ID::PALETTE_2,
		{{Pixel(0x00, 0x00, 0x00, ALPHA), colorID::COLOR_099P}, {Pixel(0x55, 0x55, 0x55, ALPHA), colorID::COLOR_066P}, {Pixel(0xAA, 0xAA, 0xAA, ALPHA), colorID::COLOR_033P}, {Pixel(0xFF, 0xFF, 0xFF, ALPHA), colorID::COLOR_000P}}}
		,{PALETTE_ID::PALETTE_3,
		{{Pixel(0x08, 0x18, 0x10, ALPHA), colorID::COLOR_099P}, {Pixel(0x39, 0x61, 0x39, ALPHA), colorID::COLOR_066P}, {Pixel(0x84, 0xA5, 0x63, ALPHA), colorID::COLOR_033P}, {Pixel(0xC6, 0xDE, 0x8C, ALPHA), colorID::COLOR_000P}}}
		,{PALETTE_ID::PALETTE_4,
		{{Pixel(0x08, 0x18, 0x20, ALPHA), colorID::COLOR_099P}, {Pixel(0x34, 0x68, 0x56, ALPHA), colorID::COLOR_066P}, {Pixel(0x88, 0xC0, 0x70, ALPHA), colorID::COLOR_033P}, {Pixel(0xE0, 0xF8, 0xD0, ALPHA), colorID::COLOR_000P}}}
	};

private:

	const char* ROM_TYPES[0x23] =
	{
		"ROM ONLY",
		"MBC1",
		"MBC1+RAM",
		"MBC1+RAM+BATTERY",
		"0x04 ???",
		"MBC2",
		"MBC2+BATTERY",
		"0x07 ???",
		"ROM+RAM 1",
		"ROM+RAM+BATTERY 1",
		"0x0A ???",
		"MMM01",
		"MMM01+RAM",
		"MMM01+RAM+BATTERY",
		"0x0E ???",
		"MBC3+TIMER+BATTERY",
		"MBC3+TIMER+RAM+BATTERY 2",
		"MBC3",
		"MBC3+RAM 2",
		"MBC3+RAM+BATTERY 2",
		"0x14 ???",
		"0x15 ???",
		"0x16 ???",
		"0x17 ???",
		"0x18 ???",
		"MBC5",
		"MBC5+RAM",
		"MBC5+RAM+BATTERY",
		"MBC5+RUMBLE",
		"MBC5+RUMBLE+RAM",
		"MBC5+RUMBLE+RAM+BATTERY",
		"0x1F ???",
		"MBC6",
		"0x21 ???",
		"MBC7+SENSOR+RUMBLE+RAM+BATTERY",
	};

	const char* LIC_CODE[0xA5] =
	{
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"Ubi Soft",
		"Atlus",
		"unknown",
		"Malibu",
		"unknown",
		"angel",
		"Bullet-Proof",
		"unknown",
		"irem",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"Absolute",
		"Acclaim",
		"Activision",
		"American sammy",
		"Konami",
		"Hi tech entertainment",
		"LJN",
		"Matchbox",
		"Mattel",
		"Milton Bradley",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"Titus",
		"Virgin",
		"unknown",
		"unknown",
		"LucasArts",
		"unknown",
		"unknown",
		"Ocean",
		"unknown",
		"Electronic Arts",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"Infogrames",
		"Interplay",
		"Broderbund",
		"sculptured",
		"unknown",
		"sci",
		"unknown",
		"unknown",
		"THQ",
		"Accolade",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"misawa",
		"unknown",
		"unknown",
		"lozc",
		"Tokuma Shoten Intermedia",
		"unknown",
		"unknown",
		"Tsukuda Original",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"Chunsoft",
		"Video system",
		"Ocean/Acclaim",
		"unknown",
		"Varie",
		"Yonezawa Toys",
		"Kaneko",
		"unknown",
		"Pack in soft",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"unknown",
		"Konami (Yu-Gi-Oh!)"
	};

	typedef struct
	{
		uint8_t CLOCK_SELECT : 1; // bit  0
		uint8_t CLOCK_SPEED : 1; // bit  1
		uint8_t RESERVED : 5; // bit  2 - 6
		uint8_t TRANSFER_ENABLE : 1; // bit  7
	} scFields_t;

	typedef union
	{
		uint8_t scMemory;
		scFields_t scFields;
	} sc_t;

	typedef struct
	{
		uint8_t title[0x000F];
		uint8_t cgbType;
	} tile_AND_cgbType_Fields_t;

	typedef union
	{
		tile_AND_cgbType_Fields_t tile_AND_cgbType_Fields;
		uint8_t title[0x0010];
	} title_AND_cgbType_t;

	typedef struct
	{
		uint8_t entryPoint[0x0004];
		uint8_t nintendologo[0x0030];
		title_AND_cgbType_t title;
		uint16_t newLicCode;
		uint8_t sgbFlag;
		uint8_t cartridgeType;
		uint8_t romSize;
		uint8_t ramSize;
		uint8_t destinationCode;
		uint8_t oldLicCode;
		uint8_t maskRomVersion;
		uint8_t headerChecksum;
		uint16_t globalChecksum;
	} cartridge_header_fields_t;

	typedef union
	{
		cartridge_header_fields_t cartridge_header_fields;
		uint8_t cartridge_header_buffer[sizeof(cartridge_header_fields_t)];
	} cartridge_header_t;

	typedef struct
	{
		uint8_t romBank00_Field1[0x0100];		// 0x0000 - 0x00FF
		cartridge_header_t cartridge_header;	// 0x0100 - 0x014F
		uint8_t romBank00_Field2[0x3EB0];		// 0x0150 - 0x3FFF
	} romBank00_Fields_t;

	typedef union
	{
		romBank00_Fields_t romBank00_Fields;
		uint8_t romBank00_Memory[0x4000];
	} romBank00_t;

	typedef struct
	{
		romBank00_t romBank_00;
		BYTE romBank_NN[0x4000];
	} codeRomFields_t;

	typedef union
	{
		codeRomFields_t codeRomFields;
		BYTE codeRomMemory[sizeof(codeRomFields_t)];
	} codeRomMemory_t;

	typedef struct
	{
		uint8_t tileData[0x0800];
	} videoRamTileDataField_t;

	typedef struct
	{
		videoRamTileDataField_t tileDataBlock[3];
	} videoRamTileDataFields_t;

	typedef struct
	{
		uint8_t tileMap[0x0400];
	} videoRamTileMapField_t;

	typedef struct
	{
		videoRamTileMapField_t tileMapBlock[2];
	} videoRamTileMapFields_t;

	typedef struct
	{
		videoRamTileDataFields_t videoRamTileDataFields;
		videoRamTileMapFields_t videoRamTileMapField;
	} videoRamFields_t;

	typedef union
	{
		videoRamFields_t videoRamFields;
		uint8_t videoRamMemory[sizeof(videoRamFields_t)];
	} videoRamMemory_t;

	typedef struct
	{
		uint8_t externalRam[0x2000];
	} externalRamFields_t;

	typedef union
	{
		externalRamFields_t externalRamFields;
		uint8_t externalRamMemory[sizeof(externalRamFields_t)];
	} externalRamMemory_t;

	typedef struct
	{
		uint8_t workRam_00[0x1000];
		uint8_t workRam_NN[0x1000];
	} workRamFields_t;

	typedef union
	{
		workRamFields_t workRamFields;
		uint8_t wRamMemory[sizeof(workRamFields_t)];
	} workRamMemory_t;

	typedef struct
	{
		uint8_t echoRam[0x1E00];
	} echoRamFields_t;

	typedef union
	{
		echoRamFields_t echoRamFields;
		uint8_t echoRamMemory[sizeof(echoRamFields_t)];
	} echoRamMemory_t;

	typedef struct
	{
		uint8_t OAM_PALETTE_NUMBER_CGB : 3; // bit  0 - 2
		uint8_t OAM_TILE_VRAM_BANK : 1; // bit  3
		uint8_t OAM_PALETTE_NUMBER_DMG : 1; // bit  4
		uint8_t OAM_X_FLIP : 1; // bit  5	
		uint8_t OAM_Y_FLIP : 1; // bit  6
		uint8_t OAM_BG_WINDOW_OVER_OBJ : 1; // bit  7
	} oamEntryFields_t;

	typedef union
	{
		oamEntryFields_t oamEntryFields;
		uint8_t oamEntryByte;
	} oamEntryByte_t;

	typedef struct
	{
		BYTE yPosition;
		BYTE xPosition;
		BYTE tileIndex;
		oamEntryByte_t attributes;
	} OAMEntry_t;

	typedef struct
	{
		OAMEntry_t OAM[(0x00A0 / FOUR)];
	} OAMFields_t;

	typedef union
	{
		OAMFields_t OAMFields;
		uint8_t OAMMemory[sizeof(OAMFields_t)];
	} OAMMemory_t;

	typedef struct
	{
		uint8_t CLOCK_SELECT : 2; // bit  0 - 1
		uint8_t TIMER_ENABLE : 1; // bit  2
		uint8_t TAC_3 : 1; // bit  3
		uint8_t TAC_4 : 1; // bit  4
		uint8_t TAC_5 : 1; // bit  5	
		uint8_t TAC_6 : 1; // bit  6
		uint8_t TAC_7 : 1; // bit  7
	} timerControlFields_t;

	typedef union
	{
		timerControlFields_t timerControlFields;
		uint8_t timerControlMemory;
	} timerControl_t;

	typedef struct
	{
		uint8_t VBLANK : 1; // bit  0
		uint8_t LCD_STAT : 1; // bit  1
		uint8_t TIMER : 1; // bit  2
		uint8_t SERIAL : 1; // bit  3
		uint8_t JOYPAD : 1; // bit  4
		uint8_t NO_INT05 : 1; // bit  5	
		uint8_t NO_INT06 : 1; // bit  6
		uint8_t NO_INT07 : 1; // bit  7
	} interruptRequestFields_t;

	typedef union
	{
		interruptRequestFields_t interruptRequestFields;
		uint8_t interruptRequestMemory;
	} interruptRequest_t;

	typedef struct
	{
		uint8_t DIV_ZERO : 1; // bit  0
		uint8_t DIV_ONE : 1; // bit  1
		uint8_t DIV_TWO : 1; // bit  2
		uint8_t DIV_THREE : 1; // bit  3
		uint8_t DIV_FOUR : 1; // bit  4
		uint8_t DIV_FIVE : 1; // bit  5	
		uint8_t DIV_SIX : 1; // bit  6
		uint8_t DIV_SEVEN : 1; // bit  7
	} divFields_t;

	typedef union
	{
		divFields_t divFields;
		uint8_t divByte;
	} divByte_t;

	typedef struct
	{
		divByte_t DIV_LSB;			// FF03
		divByte_t DIV_MSB;			// FF04
	} divBytes_t;

	typedef union
	{
		divBytes_t divBytes;
		uint16_t divMemory;
	} div_t;

	typedef struct
	{
		uint8_t BG_WINDOW_LAYER_ENABLE : 1; // bit  0
		uint8_t OBJ_ENABLE : 1; // bit  1
		uint8_t OBJ_SIZE : 1; // bit  2
		uint8_t BG_TILE_MAP_AREA : 1; // bit  3
		uint8_t BG_WINDOW_TILE_DATA_AREA : 1; // bit  4
		uint8_t WINDOW_LAYER_ENABLE : 1; // bit  5	
		uint8_t WINDOW_TILE_MAP_AREA : 1; // bit  6
		uint8_t LCD_PPU_ENABLE : 1; // bit  7
	} lcdControlFields_t;

	typedef union
	{
		lcdControlFields_t lcdControlFields;
		uint8_t lcdControlMemory;
	} lcdControl_t;

	typedef struct
	{
		uint8_t MODE : 2; // bit  0 - 1
		uint8_t LYC_EQL_LY_FLAG : 1; // bit  2
		uint8_t MODE0_HBLANK_STAT_INT_SRC : 1; // bit  3
		uint8_t MODE1_VBLANK_STAT_INT_SRC : 1; // bit  4
		uint8_t MODE2_OAM_STAT_INT_SRC : 1; // bit  5	
		uint8_t LYC_EQL_LY_STAT_INT_SRC : 1; // bit  6
		uint8_t UNUSED_07 : 1; // bit  7
	} lcdStatusFields_t;

	typedef union
	{
		lcdStatusFields_t lcdStatusFields;
		uint8_t lcdStatusMemory;
	} lcdStatus_t;

	typedef struct
	{
		uint8_t P10_RIGHT_A : 1; // bit  0
		uint8_t P11_LEFT_B : 1; // bit  1
		uint8_t P12_UP_SELECT : 1; // bit  2	
		uint8_t P13_DOWN_START : 1; // bit  3
		uint8_t P14_SEL_DIRECTION_KEYS : 1; // bit  4
		uint8_t P15_SEL_ACTION_KEYS : 1; // bit  5	
		uint8_t JP_SPARE_06 : 1; // bit  6
		uint8_t JP_SPARE_07 : 1; // bit  7
	} joyPadFields_t;

	typedef union
	{
		joyPadFields_t joyPadFields;
		BYTE joyPadMemory;
	} joyPadMemory_t;

	typedef struct
	{
		uint8_t Address : 6; // bit  0 - 5
		uint8_t SPARE_06 : 1; // bit  6
		uint8_t AutoIncrement : 1; // bit  7
	} BCPSFields_t;

	typedef union
	{
		BCPSFields_t BCPSFields;
		BYTE BCPSMemory;
	} BCPSMemory_t;

	typedef struct
	{
		uint8_t Address : 6; // bit  0 - 5
		uint8_t SPARE_06 : 1; // bit  6
		uint8_t AutoIncrement : 1; // bit  7
	} OCPSFields_t;

	typedef union
	{
		BCPSFields_t OCPSFields;
		BYTE OCPSMemory;
	} OCPSMemory_t;

	typedef struct
	{
		uint8_t Reserved0 : 2; // bits  0 - 1
		uint8_t DMGCompatibility : 1; // bit  2
		uint8_t Reserved1 : 5; // bit  3 - 7
	} KEY0Fields_t;

	typedef union
	{
		KEY0Fields_t KEY0Fields;
		BYTE KEY0Memory;
	} KEY0Memory_t;

	typedef struct
	{
		uint8_t PrepareSpeedSwitch : 1; // bit  0
		uint8_t Reserved : 6; // bit  1 - 6
		uint8_t CurrentSpeed : 1; // bit  7
	} KEY1Fields_t;

	typedef union
	{
		KEY1Fields_t KEY1Fields;
		BYTE KEY1Memory;
	} KEY1Memory_t;

	typedef struct
	{
		uint8_t sweepSlopeControl : 3; // bit  0 - 2
		uint8_t sweepDirection : 1; // bit  3
		uint8_t sweepPace : 3; // bit  4 - 6
		uint8_t reserved : 1; // bit  7 
	} channelSweepFields_t;

	typedef union
	{
		channelSweepFields_t channelSweepFields;
		BYTE channelSweepMemory;
	} channelSweepMemory_t;

	typedef struct
	{
		uint8_t initialLengthTimer : 6; // bit  0 - 5
		uint8_t waveDuty : 2; // bit  6 - 7
	} channelLengthAndDutyFields_t;

	typedef union
	{
		channelLengthAndDutyFields_t channelLengthAndDutyFields;
		BYTE channelLengthAndDutyMemory;
	} channelLengthAndDutyMemory_t;

	typedef struct
	{
		uint8_t envelopeSweepPace : 3; // bit  0 - 2
		uint8_t envelopeDirection : 1; // bit  3
		uint8_t initialVolumeOfEnvelope : 4; // bit  4 - 7
	} channelVolumeAndEnvelopeFields_t;

	typedef union
	{
		channelVolumeAndEnvelopeFields_t channelVolumeAndEnvelopeFields;
		BYTE channelVolumeAndEnvelopeMemory;
	} channelVolumeAndEnvelopeMemory_t;

	typedef struct
	{
		BYTE lowerPeriodValue;
	} channelLowerPeriodMemory_t;

	typedef struct
	{
		uint8_t higherPeriodValue : 3; // bit  0 - 2
		uint8_t reserved : 3; // bit  3 - 5
		uint8_t soundLengthEnable : 1; // bit  6
		uint8_t trigger : 1; // bit  7
	} channelHigherPeriodAndControlFields_t;

	typedef union
	{
		channelHigherPeriodAndControlFields_t channelHigherPeriodAndControlFields;
		BYTE channelHigherPeriodAndControlMemory;
	} channelHigherPeriodAndControlMemory_t;

	typedef struct
	{
		uint8_t reserved : 7; // bit  0 - 6
		uint8_t dacEnable : 1; // bit  7
	} channelDACEnableFields_t;

	typedef union
	{
		channelDACEnableFields_t channelDACEnableFields;
		BYTE channelDACEnableMemory;
	} channelDACEnableMemory_t;

	typedef struct
	{
		uint8_t reserved00 : 5; // bit  0 - 4
		uint8_t outputLevelSelection : 2; // bit  5 - 6
		uint8_t reserved01 : 1; // bit  7
	} channelOutputLevelFields_t;

	typedef union
	{
		channelOutputLevelFields_t channelOutputLevelFields;
		BYTE channelOutputLevelMemory;
	} channelOutputLevelMemory_t;

	typedef struct
	{
		uint8_t lengthTimer : 6; // bit  0 - 5
		uint8_t reserved : 1; // bit  6 - 7
	} channelLengthTimerFields_t;

	typedef union
	{
		channelLengthTimerFields_t channelLengthTimerFields;
		BYTE lengthTimerMemory;
	} channelLengthTimerMemory_t;

	typedef struct
	{
		uint8_t clockDivider : 3; // bit  0 - 2
		uint8_t LFSRwidth : 1; // bit  3
		uint8_t clockShift : 4; // bit  4 - 7
	} channelFrequencyAndRandomnessFields_t;

	typedef union
	{
		channelFrequencyAndRandomnessFields_t channelFrequencyAndRandomnessFields;
		BYTE channelFrequencyAndRandomnessMemory;
	} channelFrequencyAndRandomnessMemory_t;

	typedef struct
	{
		uint8_t rightOutputVolume : 3; // bit  0 - 2
		uint8_t mixVINToRightOutput : 1; // bit  3
		uint8_t leftOutputVolume : 3; // bit  4 - 6
		uint8_t mixVINToLeftOutput : 1; // bit  7
	} channelMasterVolumeAndVINPanningFields_t;

	typedef union
	{
		channelMasterVolumeAndVINPanningFields_t channelMasterVolumeAndVINPanningFields;
		BYTE channelMasterVolumeAndVINPanningMemory;
	} channelMasterVolumeAndVINPanningMemory_t;

	typedef struct
	{
		uint8_t mixChannel1ToRightOutput : 1; // bit  0
		uint8_t mixChannel2ToRightOutput : 1; // bit  1
		uint8_t mixChannel3ToRightOutput : 1; // bit  2
		uint8_t mixChannel4ToRightOutput : 1; // bit  3
		uint8_t mixChannel1ToLeftOutput : 1; // bit  4
		uint8_t mixChannel2ToLeftOutput : 1; // bit  5
		uint8_t mixChannel3ToLeftOutput : 1; // bit  6
		uint8_t mixChannel4ToLeftOutput : 1; // bit  7
	} channelSoundPanningFields_t;

	typedef union
	{
		channelSoundPanningFields_t channelSoundPanningFields;
		BYTE channelSoundPanningMemory;
	} channelSoundPanningMemory_t;

	typedef struct
	{
		uint8_t channel1ONFlag : 1; // bit  0
		uint8_t channel2ONFlag : 1; // bit  1
		uint8_t channel3ONFlag : 1; // bit  2
		uint8_t channel4ONFlag : 1; // bit  3
		uint8_t reserved : 3; // bit  4 - 6
		uint8_t allChannelONOFFToggle : 1; // bit  7
	} channelSoundONOFFFields_t;

	typedef union
	{
		channelSoundONOFFFields_t channelSoundONOFFFields;
		BYTE channelSoundONOFFMemory;
	} channelSoundONOFFMemory_t;

	typedef struct
	{
		uint8_t lowerNibble : 4; // bits 0 - 3
		uint8_t upperNibble : 4; // bits 4 - 7
	} samples_t;

	typedef union
	{
		samples_t samples;
		uint8_t waveRamByte;
	} waveRamByte_t;

	typedef struct
	{
		joyPadMemory_t P1_JOYP;							// FF00
		uint8_t SB;										// FF01
		sc_t SC;										// FF02
		div_t DIV;										// FF03 - FF04
		uint8_t TIMA;									// FF05
		uint8_t TMA;									// FF06
		timerControl_t TAC;								// FF07
		uint8_t SPARE_01;								// FF08
		uint8_t SPARE_02;								// FF09
		uint8_t SPARE_03;								// FF0A
		uint8_t SPARE_04;								// FF0B
		uint8_t SPARE_05;								// FF0C
		uint8_t SPARE_06;								// FF0D
		uint8_t SPARE_07;								// FF0E
		interruptRequest_t IF;							// FF0F
		channelSweepMemory_t NR10;						// FF10
		channelLengthAndDutyMemory_t NR11;				// FF11
		channelVolumeAndEnvelopeMemory_t NR12;			// FF12
		channelLowerPeriodMemory_t NR13;				// FF13
		channelHigherPeriodAndControlMemory_t NR14;		// FF14
		uint8_t SPARE_08;								// FF15
		channelLengthAndDutyMemory_t NR21;				// FF16
		channelVolumeAndEnvelopeMemory_t NR22;			// FF17
		channelLowerPeriodMemory_t NR23;				// FF18
		channelHigherPeriodAndControlMemory_t NR24;		// FF19
		channelDACEnableMemory_t NR30;					// FF1A
		uint8_t NR31;									// FF1B
		channelOutputLevelMemory_t NR32;				// FF1C
		channelLowerPeriodMemory_t NR33;				// FF1D
		channelHigherPeriodAndControlMemory_t NR34;		// FF1E
		uint8_t SPARE_09;								// FF1F
		channelLengthTimerMemory_t NR41;				// FF20
		channelVolumeAndEnvelopeMemory_t NR42;			// FF21
		channelFrequencyAndRandomnessMemory_t NR43;		// FF22
		channelHigherPeriodAndControlMemory_t NR44;		// FF23
		channelMasterVolumeAndVINPanningMemory_t NR50;	// FF24
		channelSoundPanningMemory_t NR51;				// FF25
		channelSoundONOFFMemory_t NR52;					// FF26
		uint8_t SPARE_10;								// FF27
		uint8_t SPARE_11;								// FF28
		uint8_t SPARE_12;								// FF29
		uint8_t SPARE_13;								// FF2A
		uint8_t SPARE_14;								// FF2B
		uint8_t SPARE_15;								// FF2C
		uint8_t SPARE_16;								// FF2D
		uint8_t SPARE_17;								// FF2E
		uint8_t SPARE_18;								// FF2F
		waveRamByte_t waveRam[0x0010];					// FF30 - FF3F
		lcdControl_t LCDC;								// FF40
		lcdStatus_t STAT;								// FF41
		uint8_t SCY;									// FF42
		uint8_t SCX;									// FF43
		uint8_t LY;										// FF44
		uint8_t LYC;									// FF45	
		uint8_t DMA;									// FF46	
		uint8_t BGP;									// FF47	
		uint8_t OBP0;									// FF48	
		uint8_t OBP1;									// FF49	
		uint8_t WY;										// FF4A	
		uint8_t WX;										// FF4B	
		KEY0Memory_t KEY0;								// FF4C
		KEY1Memory_t KEY1;								// FF4D
		uint8_t SPARE_20;								// FF4E	
		uint8_t VBK;									// FF4F
		uint8_t BANK;									// FF50	
		uint8_t HDMA1;									// FF51	
		uint8_t HDMA2;									// FF52	
		uint8_t HDMA3;									// FF53	
		uint8_t HDMA4;									// FF54	
		uint8_t HDMA5;									// FF55	
		uint8_t RP;										// FF56
		uint8_t SPARE_22;								// FF57	
		uint8_t SPARE_23;								// FF58	
		uint8_t SPARE_24;								// FF59	
		uint8_t SPARE_25;								// FF5A	
		uint8_t SPARE_26;								// FF5B	
		uint8_t SPARE_27;								// FF5C
		uint8_t SPARE_28;								// FF5D
		uint8_t SPARE_29;								// FF5E	
		uint8_t SPARE_30;								// FF5F
		uint8_t SPARE_31;								// FF60	
		uint8_t SPARE_32;								// FF61	
		uint8_t SPARE_33;								// FF62	
		uint8_t SPARE_34;								// FF63	
		uint8_t SPARE_35;								// FF64	
		uint8_t SPARE_36;								// FF65	
		uint8_t SPARE_37;								// FF66
		uint8_t SPARE_38;								// FF67
		BCPSMemory_t BCPS_BGPI;							// FF68	
		uint8_t BCPD_BGPD;								// FF69	
		OCPSMemory_t OCPS_OBPI;							// FF6A	
		uint8_t OCPD_OBPD;								// FF6B	
		uint8_t OPRI;									// FF6C	
		uint8_t SPARE_39;								// FF6D
		uint8_t SPARE_40;								// FF6E	
		uint8_t SPARE_41;								// FF6F	
		uint8_t SVBK;									// FF70	
		uint8_t SPARE_42;								// FF71
		uint8_t SPARE_43;   							// FF72
		uint8_t SPARE_44;   							// FF73
		uint8_t SPARE_45;   							// FF74
		uint8_t SPARE_46;								// FF75	
		uint8_t PCM12;									// FF76		
		uint8_t PCM34;									// FF77	
		uint8_t SPARE_47;								// FF78
		uint8_t SPARE_48;   							// FF79
		uint8_t SPARE_49;   							// FF7A
		uint8_t SPARE_50;   							// FF7B
		uint8_t SPARE_51;								// FF7C	
		uint8_t SPARE_52;   							// FF7D
		uint8_t SPARE_53;								// FF7E	
		uint8_t SPARE_54;   							// FF7F
	} IOFields_t;

	typedef union
	{
		IOFields_t IOFields;
		uint8_t IOMemory[sizeof(IOFields_t)];
	} IOMemory_t;

	typedef struct
	{
		uint8_t highRam[0x007F];
	} highRamFields_t;

	typedef union
	{
		highRamFields_t highRamFields;
		uint8_t highRamMemory[sizeof(highRamFields_t)];
	} highRamMemory_t;

	typedef struct
	{
		uint8_t VBLANK : 1; // bit  0
		uint8_t LCD_STAT : 1; // bit  1
		uint8_t TIMER : 1; // bit  2
		uint8_t SERIAL : 1; // bit  3
		uint8_t JOYPAD : 1; // bit  4
		uint8_t NO_INT05 : 1; // bit  5	
		uint8_t NO_INT06 : 1; // bit  6
		uint8_t NO_INT07 : 1; // bit  7
	} interruptEnableFields_t;

	typedef union
	{
		interruptEnableFields_t interruptEnableFields;
		uint8_t interruptEnableMemory;
	} interruptEnable_t;

	typedef struct
	{
		codeRomMemory_t mCodeRom;
		videoRamMemory_t mVideoRam;
		externalRamMemory_t mExternalRam;
		workRamMemory_t mWorkRam;
		echoRamMemory_t mEchoRam;
		OAMMemory_t mOAM;
		BYTE mForbidden[0x0060];
